## Pandas: Renaming Column and Indices

In [2]:
import pandas as pd
df_exams = pd.read_csv("datasets/StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [11]:
# Renaming one or more columns

df_exams.rename(columns={"gender": "sex", 
                         "race/ethnicity": "ethnicity", 
                         "test preparation course": "test prep", 
                         "math score": "math", 
                         "reading score": "reading", 
                         "writing score": "writing"}, inplace=True)
df_exams.head()

,sex,ethnicity,parental level of education,lunch,test prep,math,reading,writing
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [20]:
# Renaming indices (0, 1, 2...)

df_exams.rename(index={0: "A", 1: "B", 2: "C"}, inplace=True)
df_exams.head()

,sex,ethnicity,parental level of education,lunch,test prep,math,reading,writing
A,female,group B,bachelor's degree,standard,none,72,72,74
B,female,group C,some college,standard,completed,69,90,88
C,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75